{"data":{"allMarkdownRemark":{"totalCount":13,"edges":[{"node":{"frontmatter":{"title":"Making of the Album - instrumania","category":"music-production","tags":"reason"},"excerpt":"Instrumania  (2014) is an electronic music album, composed/produced by Raziur Rahman. It's more of a concept album and it's difficult to pin it down to any particular musical genre as a whole. But I can say that the music in this album draws influences from progressive rock, metal, classical music…"}},{"node":{"frontmatter":{"title":"Making of the track - Flow","category":"music-production","tags":"reaper"},"excerpt":"Flow is a little bluesy track where I recorded audio (acoustic guitar and electric bass) after a long time, previously last couple of years I worked only with synths and it was all midi based setup. The music production workflow gets a bit different when you work with both audio and midi. I used…"}},{"node":{"frontmatter":{"title":"Scraping web data right from the browser console","category":"coding","tags":"javascript"},"excerpt":"I have enrolled in some free online courses (MOOC) from various sites and I wanted to keep track of these courses in a spreadsheet. So I needed to copy the titles of the courses and paste into a spreadsheet. Simply copying and pasting is not so appealing as I have to clean up unwanted text thus it…"}},{"node":{"frontmatter":{"title":"JavaScript workout","category":"coding","tags":"javascript freecodecamp algorithm"},"excerpt":"Last year I spent two months (August-September, 2016) solving many programming problems at freecodecamp using JavaScript. Recently, when I wanted to review those, I thought it would be better if I have all the exercises with my solutions and notes about those if there is any, in one page. So, in…"}},{"node":{"frontmatter":{"title":"CSS Button","category":"coding","tags":"css projects"},"excerpt":"Want to brush up your CSS basics? Making some buttons of varying styles using just vanilla CSS could be a quite effective way to do just that! I was experimenting with some button styles previously, in this post I will share one button style specifically that I liked the most out my CSS button style…"}},{"node":{"frontmatter":{"title":"Filter/Search a table","category":"coding","tags":"javascript projects"},"excerpt":"This is a little project, I did to brush up my JavaScript and CSS coding skills. In this project you can interactively filter/search the data of a html table. The idea came from a w3school tutorial but I coded it from scratch and implemented some features that I think would make the user experience…"}},{"node":{"frontmatter":{"title":"Using LADSPA plugins as VST plugins","category":"music-production","tags":"ladspa vst reaper"},"excerpt":"This post will discuss how to use the LADSPA plugins,  to another VST host as VST plugins, on a Windows platform. To summarize this post:  It can be done using a VST plugin called ladspashell which loads these LADSPA plugins and makes them available to be used as VST plugins. I will be discussing…"}},{"node":{"frontmatter":{"title":"Exploring AVLinux","category":"music-production","tags":"avlinux ardour pd"},"excerpt":"In the last decade, Linux audio and music production scene has gone through many changes and improved a lot. Now, most of the common hardwares are supported out of the box and softwares have became more extensive, sophisticated and polished, although they might be buggy sometimes.  But still…"}},{"node":{"frontmatter":{"title":"Making of the track - Carbon","category":"music-production","tags":"avlinux ardour seq24 lv2 ladspa"},"excerpt":"I made my first linux-music, used AVLinux 6.01 to be more specific. Here is the link of the work:  Carbon . This post briefly documents the production process, so that I can come back later to see how I produced this work and why it sound this way, so that I can build upon this experience. Session…"}},{"node":{"frontmatter":{"title":"How I got started with Git","category":"tech-talk","tags":"git"},"excerpt":"Git extensions In order to get ideas about how revision control systems work, I have finally started trying one: it's called git. I am running  Git Extensions  on windows. It is a GUI interface for git and also comes bundled with a git installer, so it's all I needed to get started with git on my…"}},{"node":{"frontmatter":{"title":"Using spreadsheet as a simple database","category":"tech-talk","tags":"spreadsheet libreoffice"},"excerpt":"Sometimes when you have to keep track of some data and don't mind processing it in a quick and dirty fashion, spreadsheet can be of a great help. So lets review the problem at hand- you have a set of text data and you want to keep adding, refining and querying on that set. So you face the need to…"}},{"node":{"frontmatter":{"title":"Noise removal tips for single coil Guitar pickup","category":"music-production","tags":"reaper reafir noise guitar recording"},"excerpt":"Recently I was test recording my steel string acoustic guitar using a single coil pickup on REAPER. And I noticed that the pickup picked up quite noticeable power hum (50/60Hz) and some high frequency buzz around 5kHz. This usually happens with single coil pickup. So, I used the amazing ReaFIR…"}},{"node":{"frontmatter":{"title":"Using Jekyll for blogging","category":"tech-talk","tags":"jekyll github-pages"},"excerpt":"For the last few months I have been moving my blog from Blogger to Github pages and spent quite some time and energy to learn the jekyll static site generator, Liquid templating language , git/github and front-end web development in general to make the transition. Why? Here are some of the reason…"}}]}},"pageContext":{}}