{"data":{"markdownRemark":{"html":"<p>This post will discuss how to use the LADSPA plugins,  to another VST host as VST plugins, on a Windows platform. To summarize this post:  It can be done using a VST plugin called ladspashell which loads these LADSPA plugins and makes them available to be used as VST plugins. I will be discussing from the perspective of Reaper but technically you can use any other VST host like FL Studio. Scroll down and skip the text to get right to the links.</p>\n<p>LADSPA plugins are Linux audio plugins that are usually found in Linux audio environment but a set of plugins that are compiled for Windows are also supplied for Audacity to be used on Windows platform.  But even if you don't use Audacity, you can still use these LADSPA plugins on your DAW (Digital Audio Workstation) if it supports VST plugins.</p>\n<!--more-->\n<h2>Why use LADSPA as VST?</h2>\n<p>There are so many free VST plugins out there and Reaper itself comes with a lots of JS plugins. So you might wonder why you would like to use LADSPA plugins as VST. Well, your reason for using it might vary. If you use Audacity as your sound editor on windows and have the LADSPA plugins pack (which contains more than 90 plugins) and for some reason you want to use the same LADSPA plugin in your DAW that supports VST, then you can use these. So you can change effects parameters whenever you want and render only when you are done, as in Audacity you can preview little segments of sound and then you have to render it immediately. So, if you decide to use LADSPA as VST plugins, then you get the added benefit of parameter automation using curves, something that you can't do with Audacity at the moment.</p>\n<h2>LADSPASHELL VST</h2>\n<p>In order to use <a href=\"http://audacity.sourceforge.net/download/plugins?lang=en\">LADSPA plugins</a>, that are compiled for Windows platform, on a VST host, you need a VST plugin called <a href=\"http://www.xlutop.com/buzz/zip/ladspashell_v1.0.1b.zip\">ladspashell</a> (100KB). ladspashell is part of 'Polac VST Loaders for Jeskola Buzz' (<a href=\"http://www.xlutop.com/buzz/\">http://www.xlutop.com/buzz/</a>) and you can browse for this here: <a href=\"http://www.xlutop.com/buzz/zip/\">http://www.xlutop.com/buzz/zip/</a>  But you will  just need ladspashell for the purpose we are talking here.</p>\n<p>After installing ladspashell to your default VST plugin folder by unpacking the ladspashell.dll file there and then loading the plugin for the first time, you will be asked for the location of the path of directory where those LADSPA plugins are installed. After choosing the right path, the LADSPA plugins will be available to your host. How it be available will depend on the host.</p>\n<p>LADSPA plugins on Reaper-\n<img src=\"/images/ladspashell/repear-ladspa-list-or8.png\" alt=\"reaper ladspa\"></p>\n<h2>Workaround for GVerb on Reaper</h2>\n<p>Many of these LADSPA plugins are Mono channel effect processors and the host automatically assigns two instances of these plugins for stereo channels. Some plugins like GVerb which has 1 input and 2 output, you need to do extra work to get proper stereo 2 in 2 out type sound.</p>\n<p>Lets see how it's done. One quick way would be to just load two instances of the same plugin and use the plugin pin connection to assign left and right channels. You can use presets to share the same settings between these instances.</p>\n<p>Pin connection for getting proper stereo channel processing for GVerb-\n<img src=\"/images/ladspashell/repear-pin-connection-or8.png\" alt=\"pin connections\"></p>\n<p>GVerb LADSPA plugin on Audacity-\n<img src=\"/images/ladspashell/gverb-audacity-or8.png\" alt=\"gverb on audacity\"></p>\n<p>GVerb LADSPA plugin on Reaper. As you can see \"1 in 2 out\", so use proper channel routing.\n<img src=\"/images/ladspashell/gverb-reaper-or8.png\" alt=\"gverb on reaper\"></p>\n<h2>Reference</h2>\n<ul>\n<li>\n<p><a href=\"http://psycle.pastnotecut.org/thread.php?threadid=2891&#x26;boardid=5\">LADSPA plugin loader</a> - A forum post at PSYCLE.</p>\n</li>\n<li>\n<p><a href=\"http://www.kvraudio.com/forum/viewtopic.php?t=177538&#x26;start=150\">Discussions</a> that contains LADSPA wrapper at KVR Audio.</p>\n</li>\n<li>\n<p>Polac VST Loaders for Jeskola Buzz. ladspashell originated from this place. <a href=\"http://www.xlutop.com/buzz/\">http://www.xlutop.com/buzz/</a> , <a href=\"http://www.xlutop.com/buzz/zip/\">http://www.xlutop.com/buzz/zip/</a></p>\n</li>\n</ul>\n<p>(Last edited: 18 June, 2015, mostly for readability.)</p>","frontmatter":{"title":"Using LADSPA plugins as VST plugins"},"fields":{"date":"2015-01-19"}}},"pageContext":{"slug":"/blog/using-ladspa-as-vst/"}}